app/views/questions/show.html.erb

						<span class="question-date"><i class="icon-time"></i>Created <%= @question.created_at.strftime("%b %e %Y") %></span>
						<span class="question-comment"><a href="#bio"><i class="icon-comment"></i><%= pluralize(@question.answers.count, "Answer") %></a></span>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? ORDER BY created_at DESC  [["question_id", 1]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?

					<ol class="commentlist clearfix">
					    <% @question.answers.order('created_at DESC').each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? ORDER BY created_at DESC