app/views/visitors/index.html.erb

SELECT COUNT(*) FROM "questions"
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?
---
                    <span class="question-date"><i class="icon-time"></i>Updated <%= question.updated_at.strftime("%b %e %Y %l:%M %p") %></span>
                    <span class="question-comment"><a href="<%= question_path(question) %>#bio" class="smoothScroll"><i class="icon-comment"></i><%= pluralize(question.answers.count, "Answer") %></a></span>

SELECT  "questions".* FROM "questions" ORDER BY updated_at DESC LIMIT ?
---
					<ul class="related-posts">
						<% Question.order('updated_at DESC').limit(2).each do |q| %>