app/views/admin/index.html.erb

                      <td><%= mail_to user.email  %></td>
                      <td><% user.courses.each do |c| %> <%= c.short_title + ' ' %> <% end %></td>
---
SELECT "courses".* FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = ?

                      <td><%= link_to course.title, course_path(course) %></td>
                      <td><%= course.users.count %></td>
---
SELECT COUNT(*) FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = ?