app/views/admin/index.html.erb

SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?
---
                      <td><% user.courses.each do |c| %><%= link_to c.short_title + (c == user.courses.last ? ' ' : ', '), course_path(c) %><% end %><%= link_to("Edit", edit_user_path(user), :class => 'button-xs btn-primary flt-rt', "data-toggle" => "modal", "data-target" => "#editUser" + user.id.to_s) unless user == current_user %></td>
                      <td><%= link_to user.questions.count, user %></td>

SELECT COUNT(*) FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = ?
---
                      <td><%= link_to course.title, course_path(course) %></td>
                      <td><%= course.users.count %></td>