app/views/users/show.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ?
---
                <div class="tab-inner">
                  <% @user.questions.each do |question| %>

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?
---
                          <span class="question-date"><i class="icon-time"></i>Updated <%= question.updated_at.strftime("%b %e %Y %l:%M %p") %></span>
                          <span class="question-comment"><a href="<%= question_path(question) %>#bio" class="smoothScroll"><i class="icon-comment"></i><%= pluralize(question.answers.count, "Answer") %></a></span>

SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = ?
---
                <div class="tab-inner">
                  <% @user.answers.each do |answer| %>

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?
SELECT COUNT(*) FROM "answers" WHERE "answers"."user_id" = ?
---
                          <span class="question-date"><i class="icon-time"></i>Updated <%= answer.question.updated_at.strftime("%b %e %Y %l:%M %p") %></span>
                          <span class="question-comment"><a href="<%= question_path(answer.question) %>#bio" class="smoothScroll"><i class="icon-comment"></i><%= pluralize(answer.question.answers.count, "Answer") %></a></span>

SELECT "courses".* FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = ?
---
                      <tbody>
                      <% @user.courses.each do |course| %>

SELECT COUNT(*) FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = ?
---
                            <td><%= link_to course.title, course_path(course) %></td>
                            <td><%= course.users.count %></td>