app/helpers/courses_helper.rb

  def user_count(dept_courses)
    users = Set.new
    dept_courses.each { |course| users.merge course.users }
    users.count
---
SELECT "users".* FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = ?
SELECT COUNT(*) FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = ?

  def question_count(dept_courses)
    count = 0
    dept_courses.each {|course| count += course.questions.count}
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."course_id" = ?