app/views/courses/index.html.erb

                  </h3>
                  <span class="question-category"><i class="icon-folder-close"></i><%= pluralize(@dept_courses.count, 'Course') %></span>
---
SELECT  "questions".* FROM "questions" WHERE "questions"."course_id" = ? ORDER BY updated_at DESC LIMIT ?  [["course_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."course_id" = ?  [["course_id", 1]]
SELECT "courses".* FROM "courses"

          <ul class="related-posts">
            <% Question.order('updated_at DESC').limit(2).each do |q| %>
---
SELECT  "questions".* FROM "questions" ORDER BY updated_at DESC LIMIT ?