app/views/courses/show.html.erb

                      <span class="question-date"><i class="icon-time"></i>Updated <%= question.updated_at.strftime("%b %e %Y %l:%M %p") %></span>
                      <span class="question-comment"><a href="<%= question_path(question) %>#bio" class="smoothScroll"><i class="icon-comment"></i><%= pluralize(question.answers.count, "Answer") %></a></span>
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."course_id" = ?  [["course_id", 1]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?

                      <span class="question-date"><i class="icon-time"></i>Updated <%= question.updated_at.strftime("%b %e %Y %l:%M %p") %></span>
                      <span class="question-comment"><a href="<%= question_path(question) %>#bio" class="smoothScroll"><i class="icon-comment"></i><%= pluralize(question.answers.count, "Answer") %></a></span>
---
SELECT  "questions".* FROM "questions" ORDER BY updated_at DESC LIMIT ?

                  <% @users.each do |user| %>
                      <tr><td><%= link_to user.name, user_path(user) %></td><td><%= user.questions.count %></td><td><%= user.answers.count %></td><td><%= user.reputation %></td></tr>
---
SELECT COUNT(*) FROM "answers" WHERE "answers"."user_id" = ?
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?

          <ul class="related-posts">
            <% Question.order('updated_at DESC').limit(2).each do |q| %>
---
SELECT  "questions".* FROM "questions" ORDER BY updated_at DESC LIMIT ?