app/views/courses/show.html.erb

                <div class="block-stats-1"><%= link_to user.name, user_path(user) %></div>
                <div class="block-stats-2"><%= user.questions.count %></div>
                <div class="block-stats-3"><%= user.answers.count %></div>
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?
SELECT COUNT(*) FROM "answers" WHERE "answers"."user_id" = ?