app/controllers/answers_controller.rb

  def create
    @answer = Answer.new(answer_params)
    @answer.user = current_user
    respond_to do |format|
      if @answer.save
---
INSERT INTO "answers" ("question_id", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_answer
      @answer = Answer.find(params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]