app/controllers/courses_controller.rb

  def index
    @courses = Course.all
    @depts = []
    @depts = @courses.uniq.pluck(:prefix)
    @top_users = User.all.reject { |u| u.admin? }.sort_by(&:reputation).reverse[0..4]
---
SELECT "courses".* FROM "courses"
SELECT DISTINCT "courses"."prefix" FROM "courses"
SELECT "users".* FROM "users"

  def show
    @questions = @course.questions.paginate(page: params[:questions_page], per_page: 5).order('updated_at DESC')
    @users = @course.users.paginate(page: params[:users_page], per_page: 5).order('name')
---
SELECT  "questions".* FROM "questions" WHERE "questions"."course_id" = ? ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["course_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."course_id" = ?  [["course_id", 1]]
SELECT  "users".* FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = ? ORDER BY name LIMIT ? OFFSET ?  [["course_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = ?  [["course_id", 1]]