app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @questions = Question.paginate(page: params[:page], per_page: 5).order('updated_at DESC')

INSERT INTO "questions" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @question = Question.new(question_params)
    @question.user = current_user
    respond_to do |format|
      if @question.save

UPDATE "questions" SET "solved" = ?, "updated_at" = ? WHERE "questions"."id" = ?
---
  def solve
    @question.solved = 1
    @question.save

UPDATE "questions" SET "solved" = ?, "updated_at" = ? WHERE "questions"."id" = ?
---
  def unsolve
    @question.solved = 0
    @question.save