app/controllers/visitors_controller.rb

  def index
    @questions = Question.paginate(page: params[:page], per_page: 5).order('updated_at DESC')
---
SELECT  "questions".* FROM "questions" ORDER BY updated_at DESC, answers.size LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions"