app/views/layouts/application.html.erb

SELECT  "questions".* FROM "questions" ORDER BY updated_at DESC LIMIT ?
---
						<ul class="related-posts">
							<% Question.order("updated_at DESC").limit(2).each do |question| %>

SELECT "users".* FROM "users"
---
                        <tbody>
                        <% User.all.select {|u| !u.admin? }.each do |user| %>

SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?
SELECT COUNT(*) FROM "answers" WHERE "answers"."user_id" = ?
---
                              <td><% user.courses.each do |c| %><%= link_to c.short_title + (c == user.courses.last ? ' ' : ', '), course_path(c) %><% end %></td>
                              <td><%= link_to user.questions.count, user %></td>
                              <td><%= link_to user.answers.count, user %></td>

SELECT "courses".* FROM "courses"
---
                        <tbody>
                        <% Course.all.each do |course| %>

SELECT COUNT(*) FROM "users" INNER JOIN "courses_users" ON "users"."id" = "courses_users"."user_id" WHERE "courses_users"."course_id" = ?
SELECT COUNT(*) FROM "questions" WHERE "questions"."course_id" = ?
---
                              <td><%= link_to course.title, course_path(course) %></td>
                              <td><%= course.users.count %></td>
                              <td><%= course.questions.count %></td>